{
	"pastemployment": [
		{
			"company": "Bloomberg - New York, NY",
			"position": "Software Engineer",
			"timeframe": "Nov 2020 - Present",
			"details": [
				"- Designed and built live annotation pipeline for Document Ranking Model, allowing for real-time performance monitoring",
				"- Developed PySpark libraries for dataset retrieval and filtering, used company-wide"
			],
			"img": "img/employment/bloomberg.jpg",
			"href": "https://www.bloomberg.com"
		},
		{
			"company": "Local Line - Kitchener, ON",
			"position": "Software Developer (Contract)",
			"timeframe": "May - Oct 2020",
			"details": [
				"- Identified and fixed caching issues, decreasing costs by $85,200/year.",
				"- Optimized Django n+1 queries, improving page load times by over 5x",
				"- Rewrote localization and timezone support site-wide, fixing recurring timezone and DST issues"
			],
			"img": "img/employment/localline.png",
			"href": "https://site.localline.ca/"
		},
		{
			"company": "Bloomberg - New York, NY",
			"position": "Machine Learning Developer Intern (Artificial Intelligence Group)",
			"timeframe": "May - Aug 2019",
			"details": [
				"- Implemented BiLSTM + Attention language classification model to classify news vs opinion articles with 93% F1",
				"- Improved inference timing accuracy and fixed unexpected behavior in C++ model training framework",
				"- Reduced variability in model evaluation scoring by adding cross validation, and improved error breakdown",
				"- Researched combining MinHashes of tokens and Brown Clusters as features for Soft-Margin SVM"
			],
			"img": "img/employment/bloomberg.jpg",
			"href": "https://www.bloomberg.com"
		},
		{
			"company": "Miovision Technologies - Kitchener, ON",
			"position": "Machine Learning Developer Intern",
			"timeframe": "Sep - Dec 2018",
			"details": [
				"- Improved data augmentation methods and learning rate decay schedule, resulting in 61% decrease in false negative rates in production object detection model",
				"- Received company-wide recognition for resolving critical detection issues with production model causing incorrect traffic light signalling",
				"- Isolated and removed bottlenecks in training infrastructure, making model training 2x faster",
				"- Researched improving RMSProp optimizer with cyclic learning rate, resulting in better model accuracy and faster training",
				"- Rewrote Smooth L1 loss function in Tensorflow resulting in model with 50% decreased false positive rate",
				"- Created Synthetic Data using CARLA Simulator to improve model performance on underrepresented classes and challenging conditions"
			],
			"img": "img/employment/miovision.jpg",
			"href": "https://miovision.com/"
		},
		{
			"company": "Miovision Technologies - Kitchener, ON",
			"position": "Software Developer Intern",
			"timeframe": "Jan - Apr 2018",
			"details": [
				"- Utilized Ruby-Prof for performance profiling; fixes made report generation 200x faster, and PDF generation 6x faster",
				"- Optimized Ruby on Rails’ ActiveRecord ORM queries to make website performance 2.3x faster on average",
				"- Decoupled long running tasks into Sidekiq Workers to eliminate legacy code, projected to save $21,800 yearly",
				"- Diagnosed and fixed a production emergency in under 4 hours, which had caused all servers to be unresponsive"
			],
			"img": "img/employment/miovision.jpg",
			"href": "https://miovision.com/"
		},
		{
			"company": "Miovision Technologies - Kitchener, ON",
			"position": "Software Developer Intern",
			"timeframe": "Apr - Aug 2017",
			"details": [
				"- Investigated reproducing Datalink environment in Docker, allowing for 16x faster setup and cross-platform coding",
				"- Implemented data visualization tool to help sales keep track of metrics and identify target areas for expansion"
			],
			"img": "img/employment/miovision.jpg",
			"href": "https://miovision.com/"
		},
		{
			"company": "BuildDirect Design Center - Kitchener, ON",
			"position": "Software Developer Intern",
			"timeframe": "Aug - Dec 2016",
			"details": [
				"- Wrote Python layout filtering module, resulting in 33% decrease in layout generation time and improved UI",
				"- Created an integration with Github and Slack APIs to improve deployment workflow and provide visibility to engineers",
				"- Made multiple improvements to existing layout generation algorithms including complete rewrite of upper cabinet placement logic",
				"- Participated in code reviews, helped test and debug issues across entire stack"
			],
			"img": "img/employment/builddirect.png",
			"href": "https://www.builddirect.com/design-center"
		},
		{
			"company": "Videostream - Kitchener, ON",
			"position": "Software Support Specialist",
			"timeframe": "Jan - Apr 2016",
			"details": [
				"- Worked in a hybrid development/support role, taking user feedback and using it to implement requested features into Videostream app (2M+ users)",
				"- Using Javascript, implemented a Recent Downloads feature into the app, currently used by over 5000 users daily",
				"- Coded across Android (Java), iOS (Obj-C) and Web (Javascript) to implement a Netflix style Continue Watching feature",
				"- Customer support lead for over 2 million users. Resolved over 2200 support tickets in multiple languages"
			],
			"img": "img/employment/videostream.png",
			"href": "https://getvideostream.com/"
		},
		{
			"company": "DashTask - Kitchener, ON",
			"position": "Front End Web Development Intern",
			"timeframe": "Jun - Aug 2015",
			"details": [
				"- Assisted in front-end development of DashTask website, as well as visual design consulting",
				"- Specific tasks included adding expandable sections for the 'Post a New Task' page, and adding a 'Completed Task' view to both the 'All Tasks' page, and the 'User Panel' page."
			],
			"img": "img/employment/Dashtasksquare.png",
			"href": "https://www.dashtask.ca"
		},
		{
			"company": "Palette - Kitchener, ON",
			"position": "Hardware Design and Assembly Intern",
			"timeframe": "Jun - Jul 2015",
			"details": [
				"- Assisted in the design and development of Palette's premium all wood product line. Duties included assembling components, assembling and modifying the finished product, and repairing broken units.",
		        "- Created new template for Palette Website from scratch"
			],
			"img": "img/employment/Palette.jpg",
			"href": "https://www.palettegear.com"
		},
		{
			"company": "City of Kitchener - Kitchener, ON",
			"position": "Camp Counsellor",
			"timeframe": "Jul - Aug, 2012/2013/2014",
			"details": [
		        "- Planned and executed fun and educational activities for campers",
		        "- Provided supervision on field trips and monitored camper behaviour",
		        "- Ensured safety of campers at all times",
		        "- Manage weekly budget to purchase needed camp supplies",
		        "- Interact with parents and other leaders."
			],
			"img": "img/employment/Kit_Logo_RGBsquare.png",
			"href": "https://www.kitchener.ca/en/livinginkitchener/Neighbourhood-Camps.asp"
		},
		{
			"company": "St. Jacobs Country Playhouse - Kitchener, ON",
			"position": "Usher",
			"timeframe": "2010 - 2015",
			"details": [
				"- Assisted patrons, sold draw tickets and food at intermission"
			],
			"img": "img/employment/drayton-logosquare.png",
			"href": "https://www.stjacobs.com/theatre"
		}
	]
}