{
	"pastemployment": [
		{
			"company": "Local Line - Kitchener, ON",
			"position": "Software Developer (Contract)",
			"timeframe": "May - Oct 2020",
			"details": [
				"- Identified/rewrote multiple sections of code, fixing major performance issues and decreasing AWS costs by $6200/year",
				"- Optimized Django ORM queries; fixes made pages load 4x faster on average, especially for larger customers"
			],
			"img": "img/employment/localline.png",
			"href": "https://site.localline.ca/"
		},
		{
			"company": "Bloomberg - New York, NY",
			"position": "Machine Learning Developer Intern (Artificial Intelligence Group)",
			"timeframe": "May - Aug 2019",
			"details": [
				"- Improved precision of linear spam classifier by 1% to achieve 94% Precision at required 80% Recall in latency constrained environment",
				"- Experimented with combining MinHashes of tokens and Brown Clusters as features for Soft-Margin SVM",
				"- Improved inference timing accuracy and fixed feature generation bugs in C++ model training framework",
				"- Standardized model evaluation pipeline by adding dataset splitting, cross validation, and improved error breakdown",
				"- Explored difference between composition of news and opinion articles, created BiLSTM+Attention model to classify them with 93% F1.  Model and findings were presented to Artificial Intelligence Group and productized"
			],
			"img": "img/employment/bloomberg.jpg",
			"href": "https://www.bloomberg.com"
		},
		{
			"company": "Miovision Technologies - Kitchener, ON",
			"position": "Machine Learning Developer Intern",
			"timeframe": "Sep - Dec 2018",
			"details": [
				"- Designed, trained, and deployed an improved SSD object detection model to production, which decreased false negative rates by 61% on average and resolved critical detection issues.  Efforts received company-wide recognition",
				"- Rewrote Smooth L1 loss function in Tensorflow resulting in an experimental model with a 50% decreased false positive rate",
				"- Identified and fixed bottleneck in training infrastructure, making model training 2x faster on average",
				"- Created Synthetic Data Training System using CARLA Simulator and OpenCV to improve model performance on underrepresented classes and challenging conditions (headlight glare, rain, harsh shadows, etc.)",
				"- Suggested implementation of cyclic learning rate schedule, leading to better performance and shorter model training times",
				"- Trained two new full time hires on how to use the model training/validation infrastructure and helped them gain familiarity with the code base"
			],
			"img": "img/employment/miovision.jpg",
			"href": "https://miovision.com/"
		},
		{
			"company": "Miovision Technologies - Kitchener, ON",
			"position": "Software Developer Intern",
			"timeframe": "Jan - Apr 2018",
			"details": [
				"- Utilized Ruby-Prof for performance profiling; fixes made report generation 200x faster, and PDF generation 6x faster",
				"- Optimized Ruby on Rails’ ActiveRecord ORM queries to make website performance 2.3x faster on average",
				"- Decoupled long running tasks into Sidekiq Workers to eliminate legacy code, projected to save $21,800 yearly",
				"- Diagnosed and fixed a production emergency in under 4 hours, which had caused all servers to be unresponsive"
			],
			"img": "img/employment/miovision.jpg",
			"href": "https://miovision.com/"
		},
		{
			"company": "Miovision Technologies - Kitchener, ON",
			"position": "Software Developer Intern",
			"timeframe": "Apr - Aug 2017",
			"details": [
				"- Investigated reproducing Datalink environment in Docker, allowing for 16x faster setup and cross-platform coding",
				"- Implemented data visualization tool to help sales keep track of metrics and identify target areas for expansion"
			],
			"img": "img/employment/miovision.jpg",
			"href": "https://miovision.com/"
		},
		{
			"company": "BuildDirect Design Center - Kitchener, ON",
			"position": "Software Developer Intern",
			"timeframe": "Aug - Dec 2016",
			"details": [
				"- Wrote Python layout filtering module, resulting in 33% decrease in layout generation time and improved UI",
				"- Created an integration with Github and Slack APIs to improve deployment workflow and provide visibility to engineers",
				"- Made multiple improvements to existing layout generation algorithms including complete rewrite of upper cabinet placement logic",
				"- Participated in code reviews, helped test and debug issues across entire stack"
			],
			"img": "img/employment/builddirect.png",
			"href": "https://www.builddirect.com/design-center"
		},
		{
			"company": "Videostream - Kitchener, ON",
			"position": "Software Support Specialist",
			"timeframe": "Jan - Apr 2016",
			"details": [
				"- Worked in a hybrid development/support role, taking user feedback and using it to implement requested features into Videostream app (2M+ users)",
				"- Using Javascript, implemented a Recent Downloads feature into the app, currently used by over 5000 users daily",
				"- Coded across Android (Java), iOS (Obj-C) and Web (Javascript) to implement a Netflix style Continue Watching feature",
				"- Customer support lead for over 2 million users. Resolved over 2200 support tickets in multiple languages"
			],
			"img": "img/employment/videostream.png",
			"href": "https://getvideostream.com/"
		},
		{
			"company": "DashTask - Kitchener, ON",
			"position": "Front End Web Development Intern",
			"timeframe": "Jun - Aug 2015",
			"details": [
				"- Assisted in front-end development of DashTask website, as well as visual design consulting",
				"- Specific tasks included adding expandable sections for the 'Post a New Task' page, and adding a 'Completed Task' view to both the 'All Tasks' page, and the 'User Panel' page."
			],
			"img": "img/employment/Dashtasksquare.png",
			"href": "https://www.dashtask.ca"
		},
		{
			"company": "Palette - Kitchener, ON",
			"position": "Hardware Design and Assembly Intern",
			"timeframe": "Jun - Jul 2015",
			"details": [
				"- Assisted in the design and development of Palette's premium all wood product line. Duties included assembling components, assembling and modifying the finished product, and repairing broken units.",
		        "- Created new template for Palette Website from scratch"
			],
			"img": "img/employment/Palette.jpg",
			"href": "https://www.palettegear.com"
		},
		{
			"company": "City of Kitchener - Kitchener, ON",
			"position": "Camp Counsellor",
			"timeframe": "Jul - Aug, 2012/2013/2014",
			"details": [
		        "- Planned and executed fun and educational activities for campers",
		        "- Provided supervision on field trips and monitored camper behaviour",
		        "- Ensured safety of campers at all times",
		        "- Manage weekly budget to purchase needed camp supplies",
		        "- Interact with parents and other leaders."
			],
			"img": "img/employment/Kit_Logo_RGBsquare.png",
			"href": "https://www.kitchener.ca/en/livinginkitchener/Neighbourhood-Camps.asp"
		},
		{
			"company": "St. Jacobs Country Playhouse - Kitchener, ON",
			"position": "Usher",
			"timeframe": "2010 - 2015",
			"details": [
				"- Assisted patrons, sold draw tickets and food at intermission"
			],
			"img": "img/employment/drayton-logosquare.png",
			"href": "https://www.stjacobs.com/theatre"
		}
	]
}